name: "GoogleNet_veri"
#force_backward: true
layer {
  name: "data"
  type: "Python"
  top: "data_split1"
  top: "data_split2"
  top: "label_split1"
  top: "label_split2"
  top: "label_veri"
  include {
    phase: TRAIN
  }
  python_param{
    module: "pydata"
    layer: "VeriDataLayer"
    param_str: "{\'source\': \'/home/hh/Documents/caffe/models/DeepID2_inception/train_screen_ori.txt\', \'seed\': 1337, \'batch_size\': 15, \'width\': 224, \'height\': 224, \'crop\': 1, \'mirror\': 1, \'mean\': (104.00699, 116.66877, 122.67892)}"
  }
}
layer {
  name: "data"
  type: "Python"
  top: "data_split1"
  top: "data_split2"
  top: "label_split1"
  top: "label_split2"
  top: "label_veri"
  include {
    phase: TEST
  }
  python_param{
    module: "pydata"
    layer: "VeriDataLayer"
    param_str: "{\'source\': \'/home/hh/Documents/caffe/models/DeepID2_inception/val_screen_ori.txt\', \'seed\': 1337, \'batch_size\': 10, \'width\': 224, \'height\': 224, \'crop\': 1, \'mirror\': 1, \'mean\': (104.00699, 116.66877, 122.67892)}"
  }
}
layer {
  name: "conv1/7x7_s2"
  type: "Convolution"
  bottom: "data_split1"
  top: "conv1/7x7_s2_split1"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1/relu_7x7"
  type: "ReLU"
  bottom: "conv1/7x7_s2_split1"
  top: "conv1/7x7_s2_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "conv1/7x7_s2_split1"
  top: "pool1/3x3_s2_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1/norm1"
  type: "LRN"
  bottom: "pool1/3x3_s2_split1"
  top: "pool1/norm1_split1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2/3x3_reduce"
  type: "Convolution"
  bottom: "pool1/norm1_split1"
  top: "conv2/3x3_reduce_split1"
  param {
    name: "conv2_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2/3x3_reduce_split1"
  top: "conv2/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "conv2/3x3"
  type: "Convolution"
  bottom: "conv2/3x3_reduce_split1"
  top: "conv2/3x3_split1"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3"
  type: "ReLU"
  bottom: "conv2/3x3_split1"
  top: "conv2/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "conv2/norm2"
  type: "LRN"
  bottom: "conv2/3x3_split1"
  top: "conv2/norm2_split1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2/3x3_s2"
  type: "Pooling"
  bottom: "conv2/norm2_split1"
  top: "pool2/3x3_s2_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a/1x1"
  type: "Convolution"
  bottom: "pool2/3x3_s2_split1"
  top: "inception_3a/1x1_split1"
  param {
	 name: "inception_3a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
	 name: "inception_3a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inception_3a/1x1_split1"
  top: "inception_3a/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "pool2/3x3_s2_split1"
  top: "inception_3a/3x3_reduce_split1"
  param {
    name: "inception_3a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
	 name: "inception_3a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce_split1"
  top: "inception_3a/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/3x3"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_split1"
  top: "inception_3a/3x3_split1"
  param {
    name: "inception_3a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inception_3a/3x3_split1"
  top: "inception_3a/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/5x5_reduce"
  type: "Convolution"
  bottom: "pool2/3x3_s2_split1"
  top: "inception_3a/5x5_reduce_split1"
  param {
    name: "inception_3a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce_split1"
  top: "inception_3a/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/5x5"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce_split1"
  top: "inception_3a/5x5_split1"
  param {
    name: "inception_3a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
	 name: "inception_3a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "inception_3a/5x5_split1"
  top: "inception_3a/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "pool2/3x3_s2_split1"
  top: "inception_3a/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "Convolution"
  bottom: "inception_3a/pool_split1"
  top: "inception_3a/pool_proj_split1"
  param {
    name: "inception_3a/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a/pool_proj_split1"
  top: "inception_3a/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1_split1"
  bottom: "inception_3a/3x3_split1"
  bottom: "inception_3a/5x5_split1"
  bottom: "inception_3a/pool_proj_split1"
  top: "inception_3a/output_split1"
}
layer {
  name: "inception_3b/1x1"
  type: "Convolution"
  bottom: "inception_3a/output_split1"
  top: "inception_3b/1x1_split1"
  param {
    name: "inception_3b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "inception_3b/1x1_split1"
  top: "inception_3b/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output_split1"
  top: "inception_3b/3x3_reduce_split1"
  param {
    name: "inception_3b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce_split1"
  top: "inception_3b/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3b/3x3"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce_split1"
  top: "inception_3b/3x3_split1"
  param {
    name: "inception_3b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inception_3b/3x3_split1"
  top: "inception_3b/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3b/5x5_reduce"
  type: "Convolution"
  bottom: "inception_3a/output_split1"
  top: "inception_3b/5x5_reduce_split1"
  param {
    name: "inception_3b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3b/5x5_reduce_split1"
  top: "inception_3b/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3b/5x5"
  type: "Convolution"
  bottom: "inception_3b/5x5_reduce_split1"
  top: "inception_3b/5x5_split1"
  param {
    name: "inception_3b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "inception_3b/5x5_split1"
  top: "inception_3b/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output_split1"
  top: "inception_3b/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b/pool_proj"
  type: "Convolution"
  bottom: "inception_3b/pool_split1"
  top: "inception_3b/pool_proj_split1"
  param {
    name: "inception_3b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3b/pool_proj_split1"
  top: "inception_3b/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3b/output"
  type: "Concat"
  bottom: "inception_3b/1x1_split1"
  bottom: "inception_3b/3x3_split1"
  bottom: "inception_3b/5x5_split1"
  bottom: "inception_3b/pool_proj_split1"
  top: "inception_3b/output_split1"
}
layer {
  name: "pool3/3x3_s2"
  type: "Pooling"
  bottom: "inception_3b/output_split1"
  top: "pool3/3x3_s2_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_4a/1x1"
  type: "Convolution"
  bottom: "pool3/3x3_s2_split1"
  top: "inception_4a/1x1_split1"
  param {
    name: "inception_4a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_1x1"
  type: "ReLU"
  bottom: "inception_4a/1x1_split1"
  top: "inception_4a/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4a/3x3_reduce"
  type: "Convolution"
  bottom: "pool3/3x3_s2_split1"
  top: "inception_4a/3x3_reduce_split1"
  param {
    name: "inception_4a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4a/3x3_reduce_split1"
  top: "inception_4a/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4a/3x3"
  type: "Convolution"
  bottom: "inception_4a/3x3_reduce_split1"
  top: "inception_4a/3x3_split1"
  param {
    name: "inception_4a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3"
  type: "ReLU"
  bottom: "inception_4a/3x3_split1"
  top: "inception_4a/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4a/5x5_reduce"
  type: "Convolution"
  bottom: "pool3/3x3_s2_split1"
  top: "inception_4a/5x5_reduce_split1"
  param {
    name: "inception_4a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4a/5x5_reduce_split1"
  top: "inception_4a/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4a/5x5"
  type: "Convolution"
  bottom: "inception_4a/5x5_reduce_split1"
  top: "inception_4a/5x5_split1"
  param {
    name: "inception_4a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5"
  type: "ReLU"
  bottom: "inception_4a/5x5_split1"
  top: "inception_4a/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4a/pool"
  type: "Pooling"
  bottom: "pool3/3x3_s2_split1"
  top: "inception_4a/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a/pool_proj"
  type: "Convolution"
  bottom: "inception_4a/pool_split1"
  top: "inception_4a/pool_proj_split1"
  param {
    name: "inception_4a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4a/pool_proj_split1"
  top: "inception_4a/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4a/output"
  type: "Concat"
  bottom: "inception_4a/1x1_split1"
  bottom: "inception_4a/3x3_split1"
  bottom: "inception_4a/5x5_split1"
  bottom: "inception_4a/pool_proj_split1"
  top: "inception_4a/output_split1"
}
layer {
  name: "loss1/ave_pool"
  type: "Pooling"
  bottom: "inception_4a/output_split1"
  top: "loss1/ave_pool_split1"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "loss1/conv"
  type: "Convolution"
  bottom: "loss1/ave_pool_split1"
  top: "loss1/conv_split1"
  param {
    name: "loss1/conv_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss1/conv_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss1/relu_conv"
  type: "ReLU"
  bottom: "loss1/conv_split1"
  top: "loss1/conv_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "loss1/fc"
  type: "InnerProduct"
  bottom: "loss1/conv_split1"
  top: "loss1/fc_split1"
  param {
    name: "loss1/fc_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss1/fc_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss1/relu_fc"
  type: "ReLU"
  bottom: "loss1/fc_split1"
  top: "loss1/fc_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "loss1/drop_fc"
  type: "Dropout"
  bottom: "loss1/fc_split1"
  top: "loss1/fc_split1"
  dropout_param {
    dropout_ratio: 0.7
  }
}
layer {
  name: "loss1/classifier_new"
  type: "InnerProduct"
  bottom: "loss1/fc_split1"
  top: "loss1/classifier_new_split1"
  param {
    name: "loss1/classifier_new_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss1/classifier_new_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss1/loss"
  type: "SoftmaxWithLoss"
  bottom: "loss1/classifier_new_split1"
  bottom: "label_split1"
  top: "loss1/loss1_split1"
  loss_weight: 0.1
}
layer {
  name: "loss1/top-1"
  type: "Accuracy"
  bottom: "loss1/classifier_new_split1"
  bottom: "label_split1"
  top: "loss1/top-1_split1"
}
layer {
  name: "loss1/top-5"
  type: "Accuracy"
  bottom: "loss1/classifier_new_split1"
  bottom: "label_split1"
  top: "loss1/top-5_split1"
  accuracy_param {
    top_k: 5
  }
}

layer {
  name: "inception_4b/1x1"
  type: "Convolution"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/1x1_split1"
  param {
    name: "inception_4b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_1x1"
  type: "ReLU"
  bottom: "inception_4b/1x1_split1"
  top: "inception_4b/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/3x3_reduce_split1"
  param {
    name: "inception_4b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4b/3x3_reduce_split1"
  top: "inception_4b/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4b/3x3"
  type: "Convolution"
  bottom: "inception_4b/3x3_reduce_split1"
  top: "inception_4b/3x3_split1"
  param {
    name: "inception_4b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3"
  type: "ReLU"
  bottom: "inception_4b/3x3_split1"
  top: "inception_4b/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4b/5x5_reduce"
  type: "Convolution"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/5x5_reduce_split1"
  param {
    name: "inception_4b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
	 name: "inception_4b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4b/5x5_reduce_split1"
  top: "inception_4b/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4b/5x5"
  type: "Convolution"
  bottom: "inception_4b/5x5_reduce_split1"
  top: "inception_4b/5x5_split1"
  param {
    name: "inception_4b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
	 name: "inception_4b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5"
  type: "ReLU"
  bottom: "inception_4b/5x5_split1"
  top: "inception_4b/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4b/pool"
  type: "Pooling"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4b/pool_proj"
  type: "Convolution"
  bottom: "inception_4b/pool_split1"
  top: "inception_4b/pool_proj_split1"
  param {
    name: "inception_4b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4b/pool_proj_split1"
  top: "inception_4b/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4b/output"
  type: "Concat"
  bottom: "inception_4b/1x1_split1"
  bottom: "inception_4b/3x3_split1"
  bottom: "inception_4b/5x5_split1"
  bottom: "inception_4b/pool_proj_split1"
  top: "inception_4b/output_split1"
}
layer {
  name: "inception_4c/1x1"
  type: "Convolution"
  bottom: "inception_4b/output_split1"
  top: "inception_4c/1x1_split1"
  param {
    name: "inception_4c/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_1x1"
  type: "ReLU"
  bottom: "inception_4c/1x1_split1"
  top: "inception_4c/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4c/3x3_reduce"
  type: "Convolution"
  bottom: "inception_4b/output_split1"
  top: "inception_4c/3x3_reduce_split1"
  param {
    name: "inception_4c/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4c/3x3_reduce_split1"
  top: "inception_4c/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4c/3x3"
  type: "Convolution"
  bottom: "inception_4c/3x3_reduce_split1"
  top: "inception_4c/3x3_split1"
  param {
    name: "inception_4c/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_3x3"
  type: "ReLU"
  bottom: "inception_4c/3x3_split1"
  top: "inception_4c/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4c/5x5_reduce"
  type: "Convolution"
  bottom: "inception_4b/output_split1"
  top: "inception_4c/5x5_reduce_split1"
  param {
    name: "inception_4c/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4c/5x5_reduce_split1"
  top: "inception_4c/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4c/5x5"
  type: "Convolution"
  bottom: "inception_4c/5x5_reduce_split1"
  top: "inception_4c/5x5_split1"
  param {
    name: "inception_4c/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_5x5"
  type: "ReLU"
  bottom: "inception_4c/5x5_split1"
  top: "inception_4c/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4c/pool"
  type: "Pooling"
  bottom: "inception_4b/output_split1"
  top: "inception_4c/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4c/pool_proj"
  type: "Convolution"
  bottom: "inception_4c/pool_split1"
  top: "inception_4c/pool_proj_split1"
  param {
    name: "inception_4c/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4c/pool_proj_split1"
  top: "inception_4c/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4c/output"
  type: "Concat"
  bottom: "inception_4c/1x1_split1"
  bottom: "inception_4c/3x3_split1"
  bottom: "inception_4c/5x5_split1"
  bottom: "inception_4c/pool_proj_split1"
  top: "inception_4c/output_split1"
}
layer {
  name: "inception_4d/1x1"
  type: "Convolution"
  bottom: "inception_4c/output_split1"
  top: "inception_4d/1x1_split1"
  param {
    name: "inception_4d/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_1x1"
  type: "ReLU"
  bottom: "inception_4d/1x1_split1"
  top: "inception_4d/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4d/3x3_reduce"
  type: "Convolution"
  bottom: "inception_4c/output_split1"
  top: "inception_4d/3x3_reduce_split1"
  param {
    name: "inception_4d/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 144
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4d/3x3_reduce_split1"
  top: "inception_4d/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4d/3x3"
  type: "Convolution"
  bottom: "inception_4d/3x3_reduce_split1"
  top: "inception_4d/3x3_split1"
  param {
    name: "inception_4d/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 288
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_3x3"
  type: "ReLU"
  bottom: "inception_4d/3x3_split1"
  top: "inception_4d/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4d/5x5_reduce"
  type: "Convolution"
  bottom: "inception_4c/output_split1"
  top: "inception_4d/5x5_reduce_split1"
  param {
    name: "inception_4d/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4d/5x5_reduce_split1"
  top: "inception_4d/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4d/5x5"
  type: "Convolution"
  bottom: "inception_4d/5x5_reduce_split1"
  top: "inception_4d/5x5_split1"
  param {
    name: "inception_4d/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_5x5"
  type: "ReLU"
  bottom: "inception_4d/5x5_split1"
  top: "inception_4d/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4d/pool"
  type: "Pooling"
  bottom: "inception_4c/output_split1"
  top: "inception_4d/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4d/pool_proj"
  type: "Convolution"
  bottom: "inception_4d/pool_split1"
  top: "inception_4d/pool_proj_split1"
  param {
    name: "inception_4d/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4d/pool_proj_split1"
  top: "inception_4d/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4d/output"
  type: "Concat"
  bottom: "inception_4d/1x1_split1"
  bottom: "inception_4d/3x3_split1"
  bottom: "inception_4d/5x5_split1"
  bottom: "inception_4d/pool_proj_split1"
  top: "inception_4d/output_split1"
}
layer {
  name: "loss2/ave_pool"
  type: "Pooling"
  bottom: "inception_4d/output_split1"
  top: "loss2/ave_pool_split1"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "loss2/conv"
  type: "Convolution"
  bottom: "loss2/ave_pool_split1"
  top: "loss2/conv_split1"
  param {
    name: "loss2/conv_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss2/conv_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss2/relu_conv"
  type: "ReLU"
  bottom: "loss2/conv_split1"
  top: "loss2/conv_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "loss2/fc"
  type: "InnerProduct"
  bottom: "loss2/conv_split1"
  top: "loss2/fc_split1"
  param {
    name: "loss2/fc_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss2/fc_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss2/relu_fc"
  type: "ReLU"
  bottom: "loss2/fc_split1"
  top: "loss2/fc_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "loss2/drop_fc"
  type: "Dropout"
  bottom: "loss2/fc_split1"
  top: "loss2/fc_split1"
  dropout_param {
    dropout_ratio: 0.7
  }
}
layer {
  name: "loss2/classifier_new"
  type: "InnerProduct"
  bottom: "loss2/fc_split1"
  top: "loss2/classifier_new_split1"
  param {
    name: "loss2/classifier_new_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss2/classifier_new_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss2/loss"
  type: "SoftmaxWithLoss"
  bottom: "loss2/classifier_new_split1"
  bottom: "label_split1"
  top: "loss2/loss2_split1"
  loss_weight: 0.1
}
layer {
  name: "loss2/top-1"
  type: "Accuracy"
  bottom: "loss2/classifier_new_split1"
  bottom: "label_split1"
  top: "loss2/top-1_split1"
}
layer {
  name: "loss2/top-5"
  type: "Accuracy"
  bottom: "loss2/classifier_new_split1"
  bottom: "label_split1"
  top: "loss2/top-5_split1"
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "inception_4e/1x1"
  type: "Convolution"
  bottom: "inception_4d/output_split1"
  top: "inception_4e/1x1_split1"
  param {
    name: "inception_4e/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_1x1"
  type: "ReLU"
  bottom: "inception_4e/1x1_split1"
  top: "inception_4e/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4e/3x3_reduce"
  type: "Convolution"
  bottom: "inception_4d/output_split1"
  top: "inception_4e/3x3_reduce_split1"
  param {
    name: "inception_4e/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4e/3x3_reduce_split1"
  top: "inception_4e/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4e/3x3"
  type: "Convolution"
  bottom: "inception_4e/3x3_reduce_split1"
  top: "inception_4e/3x3_split1"
  param {
    name: "inception_4e/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_3x3"
  type: "ReLU"
  bottom: "inception_4e/3x3_split1"
  top: "inception_4e/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4e/5x5_reduce"
  type: "Convolution"
  bottom: "inception_4d/output_split1"
  top: "inception_4e/5x5_reduce_split1"
  param {
    name: "inception_4e/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4e/5x5_reduce_split1"
  top: "inception_4e/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4e/5x5"
  type: "Convolution"
  bottom: "inception_4e/5x5_reduce_split1"
  top: "inception_4e/5x5_split1"
  param {
    name: "inception_4e/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_5x5"
  type: "ReLU"
  bottom: "inception_4e/5x5_split1"
  top: "inception_4e/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4e/pool"
  type: "Pooling"
  bottom: "inception_4d/output_split1"
  top: "inception_4e/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4e/pool_proj"
  type: "Convolution"
  bottom: "inception_4e/pool_split1"
  top: "inception_4e/pool_proj_split1"
  param {
    name: "inception_4e/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4e/pool_proj_split1"
  top: "inception_4e/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_4e/output"
  type: "Concat"
  bottom: "inception_4e/1x1_split1"
  bottom: "inception_4e/3x3_split1"
  bottom: "inception_4e/5x5_split1"
  bottom: "inception_4e/pool_proj_split1"
  top: "inception_4e/output_split1"
}
layer {
  name: "pool4/3x3_s2"
  type: "Pooling"
  bottom: "inception_4e/output_split1"
  top: "pool4/3x3_s2_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_5a/1x1"
  type: "Convolution"
  bottom: "pool4/3x3_s2_split1"
  top: "inception_5a/1x1_split1"
  param {
    name: "inception_5a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_1x1"
  type: "ReLU"
  bottom: "inception_5a/1x1_split1"
  top: "inception_5a/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5a/3x3_reduce"
  type: "Convolution"
  bottom: "pool4/3x3_s2_split1"
  top: "inception_5a/3x3_reduce_split1"
  param {
    name: "inception_5a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_5a/3x3_reduce_split1"
  top: "inception_5a/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5a/3x3"
  type: "Convolution"
  bottom: "inception_5a/3x3_reduce_split1"
  top: "inception_5a/3x3_split1"
  param {
    name: "inception_5a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3"
  type: "ReLU"
  bottom: "inception_5a/3x3_split1"
  top: "inception_5a/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5a/5x5_reduce"
  type: "Convolution"
  bottom: "pool4/3x3_s2_split1"
  top: "inception_5a/5x5_reduce_split1"
  param {
    name: "inception_5a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_5a/5x5_reduce_split1"
  top: "inception_5a/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5a/5x5"
  type: "Convolution"
  bottom: "inception_5a/5x5_reduce_split1"
  top: "inception_5a/5x5_split1"
  param {
    name: "inception_5a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
	 name: "inception_5a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5"
  type: "ReLU"
  bottom: "inception_5a/5x5_split1"
  top: "inception_5a/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5a/pool"
  type: "Pooling"
  bottom: "pool4/3x3_s2_split1"
  top: "inception_5a/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5a/pool_proj"
  type: "Convolution"
  bottom: "inception_5a/pool_split1"
  top: "inception_5a/pool_proj_split1"
  param {
    name: "inception_5a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_5a/pool_proj_split1"
  top: "inception_5a/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5a/output"
  type: "Concat"
  bottom: "inception_5a/1x1_split1"
  bottom: "inception_5a/3x3_split1"
  bottom: "inception_5a/5x5_split1"
  bottom: "inception_5a/pool_proj_split1"
  top: "inception_5a/output_split1"
}
layer {
  name: "inception_5b/1x1"
  type: "Convolution"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/1x1_split1"
  param {
    name: "inception_5b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_1x1"
  type: "ReLU"
  bottom: "inception_5b/1x1_split1"
  top: "inception_5b/1x1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/3x3_reduce_split1"
  param {
    name: "inception_5b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_5b/3x3_reduce_split1"
  top: "inception_5b/3x3_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5b/3x3"
  type: "Convolution"
  bottom: "inception_5b/3x3_reduce_split1"
  top: "inception_5b/3x3_split1"
  param {
    name: "inception_5b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3"
  type: "ReLU"
  bottom: "inception_5b/3x3_split1"
  top: "inception_5b/3x3_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5b/5x5_reduce"
  type: "Convolution"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/5x5_reduce_split1"
  param {
    name: "inception_5b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_5b/5x5_reduce_split1"
  top: "inception_5b/5x5_reduce_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5b/5x5"
  type: "Convolution"
  bottom: "inception_5b/5x5_reduce_split1"
  top: "inception_5b/5x5_split1"
  param {
    name: "inception_5b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5"
  type: "ReLU"
  bottom: "inception_5b/5x5_split1"
  top: "inception_5b/5x5_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5b/pool"
  type: "Pooling"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5b/pool_proj"
  type: "Convolution"
  bottom: "inception_5b/pool_split1"
  top: "inception_5b/pool_proj_split1"
  param {
    name: "inception_5b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_5b/pool_proj_split1"
  top: "inception_5b/pool_proj_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_5b/output"
  type: "Concat"
  bottom: "inception_5b/1x1_split1"
  bottom: "inception_5b/3x3_split1"
  bottom: "inception_5b/5x5_split1"
  bottom: "inception_5b/pool_proj_split1"
  top: "inception_5b/output_split1"
}
layer {
  name: "pool5/7x7_s1"
  type: "Pooling"
  bottom: "inception_5b/output_split1"
  top: "pool5/7x7_s1_split1"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "pool5/drop_7x7_s1"
  type: "Dropout"
  bottom: "pool5/7x7_s1_split1"
  top: "pool5/7x7_s1_split1"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "loss3/classifier_new"
  type: "InnerProduct"
  bottom: "pool5/7x7_s1_split1"
  top: "loss3/classifier_new_split1"
  param {
    name: "loss3/classifier_new_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss3/classifier_new_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss3/loss3"
  type: "SoftmaxWithLoss"
  bottom: "loss3/classifier_new_split1"
  bottom: "label_split1"
  top: "loss3/loss3_split1"
  loss_weight: 1
}
layer {
  name: "loss3/top-1"
  type: "Accuracy"
  bottom: "loss3/classifier_new_split1"
  bottom: "label_split1"
  top: "loss3/top-1_split1"
}
layer {
  name: "loss3/top-5"
  type: "Accuracy"
  bottom: "loss3/classifier_new_split1"
  bottom: "label_split1"
  top: "loss3/top-5_split1"
  accuracy_param {
    top_k: 5
  }
}



layer {
  name: "conv1/7x7_s2_split2"
  type: "Convolution"
  bottom: "data_split2"
  top: "conv1/7x7_s2_split2"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
