name: "FaceNet"
layer {
  name: "data"
  type: "Python"
  top: "data1"
  top: "data2"
  top: "label1"
  top: "label2"
  top: "label_veri"
  include {
    phase: TRAIN
  }
  python_param{
    module: "pydata"
    layer: "VeriDataLayer"
    param_str: "{\'source\': \'/home/hh/Documents/caffe/models/DeepID2_inception/train_screen_ori.txt\', \'seed\': 1337, \'batch_size\': 15, \'width\': 224, \'height\': 224, \'crop\': 1, \'mirror\': 1, \'mean\': (104.00699, 116.66877, 122.67892)}"
  }
}
layer {
  name: "data"
  type: "Python"
  top: "data1"
  top: "data2"
  top: "label1"
  top: "label2"
  top: "label_veri"
  include {
    phase: TEST
  }
  python_param{
    module: "pydata"
    layer: "VeriDataLayer"
    param_str: "{\'source\': \'/home/hh/Documents/caffe/models/DeepID2_inception/val_screen_ori.txt\', \'seed\': 1337, \'batch_size\': 10, \'width\': 224, \'height\': 224, \'crop\': 1, \'mirror\': 1, \'mean\': (104.00699, 116.66877, 122.67892)}"
  }
}
layer {
  name: "conv1_split1"
  type: "Convolution"
  bottom: "data1"
  top: "conv1_split1"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1/relu_split1"
  type: "ReLU"
  bottom: "conv1_split1"
  top: "conv1_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "conv2_split1"
  type: "Convolution"
  bottom: "conv1_split1"
  top: "conv2_split1"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_split1"
  type: "ReLU"
  bottom: "conv2_split1"
  top: "conv2_split1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/1x1_split1"
  type: "Convolution"
  bottom: "conv2_split1"
  top: "inception_3a/1x1_split1"
  param {
    name: "inception3a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1_split1"
  type: "ReLU"
  bottom: "inception_3a/1x1_split1"
  top: "inception_3a/1x1_split1"
}
layer {
  name: "inception_3a/3x3_reduce_split1"
  type: "Convolution"
  bottom: "conv2_split1"
  top: "inception_3a/3x3_reduce_split1"
  param {
    name: "inception3a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce_split1"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce_split1"
  top: "inception_3a/3x3_reduce_split1"
}
layer {
  name: "inception_3a/3x3_split1"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_split1"
  top: "inception_3a/3x3_split1"
  param {
    name: "inception3a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_split1"
  type: "ReLU"
  bottom: "inception_3a/3x3_split1"
  top: "inception_3a/3x3_split1"
}
layer {
  name: "inception_3a/5x5_reduce_split1"
  type: "Convolution"
  bottom: "conv2_split1"
  top: "inception_3a/5x5_reduce_split1"
  param {
    name: "inception3a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce_split1"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce_split1"
  top: "inception_3a/5x5_reduce_split1"
}
layer {
  name: "inception_3a/5x5_split1"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce_split1"
  top: "inception_3a/5x5_split1"
  param {
    name: "inception3a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_split1"
  type: "ReLU"
  bottom: "inception_3a/5x5_split1"
  top: "inception_3a/5x5_split1"
}
layer {
  name: "inception_3a/pool_split1"
  type: "Pooling"
  bottom: "conv2_split1"
  top: "inception_3a/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj_split1"
  type: "Convolution"
  bottom: "inception_3a/pool_split1"
  top: "inception_3a/pool_proj_split1"
  param {
    name: "inception3a/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_pool_proj_split1"
  type: "ReLU"
  bottom: "inception_3a/pool_proj_split1"
  top: "inception_3a/pool_proj_split1"
}
layer {
  name: "inception_3a/output_split1"
  type: "Concat"
  bottom: "inception_3a/1x1_split1"
  bottom: "inception_3a/3x3_split1"
  bottom: "inception_3a/5x5_split1"
  bottom: "inception_3a/pool_proj_split1"
  top: "inception_3a/output_split1"
}
layer {
  name: "pool3/2x2_s2_split1"
  type: "Pooling"
  bottom: "inception_3a/output_split1"
  top: "pool3/2x2_s2_split1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "loss_aux1/5x5_s4_split1"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split1"
  top: "loss_aux1/5x5_s4_split1"
  param {
    name: "loss_aux1/5x5_s4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss_aux1/5x5_s4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    stride: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss_aux1/5x5_s4_relu_split1"
  type: "ReLU"
  bottom: "loss_aux1/5x5_s4_split1"
  top: "loss_aux1/5x5_s4_split1"
}
layer {
  name: "loss_aux1/pool_split1"
  type: "Pooling"
  bottom: "loss_aux1/5x5_s4_split1"
  top: "loss_aux1/pool_split1"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "loss_aux1/drop_split1"
  type: "Dropout"
  bottom: "loss_aux1/pool_split1"
  top: "loss_aux1/dropout_split1"
  dropout_param {
    dropout_ratio: 0.3
  }
}
layer {
  name: "loss_aux1/classifier_split1"
  type: "InnerProduct"
  bottom: "loss_aux1/dropout_split1"
  top: "loss_aux1/classifier_split1"
  param {
    name: "loss1/classifier_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss1/classifier_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_aux1/loss_split1"
  type: "SoftmaxWithLoss"
  bottom: "loss_aux1/classifier_split1"
  bottom: "label2"
  top: "loss_aux1/loss_split1"
  loss_weight: 0.3
}
layer {
  name: "loss_aux1/top-01_split1"
  type: "Accuracy"
  bottom: "loss_aux1/classifier_split1"
  bottom: "label2"
  top: "loss_aux1/top-1_split1"
  #include {
  #  phase: TEST
  #}
}
layer {
  name: "loss_aux1/top-5_split1"
  type: "Accuracy"
  bottom: "loss_aux1/classifier_split1"
  bottom: "label2"
  top: "loss_aux1/top-5_split1"
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "inception_4a/1x1_split1"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split1"
  top: "inception_4a/1x1_split1"
  param {
    name: "inception4a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_1x1_split1"
  type: "ReLU"
  bottom: "inception_4a/1x1_split1"
  top: "inception_4a/1x1_split1"
}
layer {
  name: "inception_4a/3x3_reduce_split1"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split1"
  top: "inception_4a/3x3_reduce_split1"
  param {
    name: "inception4a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_reduce_split1"
  type: "ReLU"
  bottom: "inception_4a/3x3_reduce_split1"
  top: "inception_4a/3x3_reduce_split1"
}
layer {
  name: "inception_4a/3x3_split1"
  type: "Convolution"
  bottom: "inception_4a/3x3_reduce_split1"
  top: "inception_4a/3x3_split1"
  param {
    name: "inception4a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_split1"
  type: "ReLU"
  bottom: "inception_4a/3x3_split1"
  top: "inception_4a/3x3_split1"
}
layer {
  name: "inception_4a/5x5_reduce_split1"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split1"
  top: "inception_4a/5x5_reduce_split1"
  param {
    name: "inception4a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_reduce_split1"
  type: "ReLU"
  bottom: "inception_4a/5x5_reduce_split1"
  top: "inception_4a/5x5_reduce_split1"
}
layer {
  name: "inception_4a/5x5_split1"
  type: "Convolution"
  bottom: "inception_4a/5x5_reduce_split1"
  top: "inception_4a/5x5_split1"
  param {
    name: "inception4a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_split1"
  type: "ReLU"
  bottom: "inception_4a/5x5_split1"
  top: "inception_4a/5x5_split1"
}
layer {
  name: "inception_4a/pool_split1"
  type: "Pooling"
  bottom: "pool3/2x2_s2_split1"
  top: "inception_4a/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a/pool_proj_split1"
  type: "Convolution"
  bottom: "inception_4a/pool_split1"
  top: "inception_4a/pool_proj_split1"
  param {
    name: "inception4a/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/ptoj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_pool_proj_split1"
  type: "ReLU"
  bottom: "inception_4a/pool_proj_split1"
  top: "inception_4a/pool_proj_split1"
}
layer {
  name: "inception_4a/output_split1"
  type: "Concat"
  bottom: "inception_4a/1x1_split1"
  bottom: "inception_4a/3x3_split1"
  bottom: "inception_4a/5x5_split1"
  bottom: "inception_4a/pool_proj_split1"
  top: "inception_4a/output_split1"
}
layer {
  name: "inception_4a/drop_split1"
  type: "Dropout"
  bottom: "inception_4a/output_split1"
  top: "inception_4a/output_split1"
  dropout_param {
    dropout_ratio: 0.35
  }
}
layer {
  name: "inception_4b/1x1_split1"
  type: "Convolution"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/1x1_split1"
  param {
    name: "inception4b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_1x1_split1"
  type: "ReLU"
  bottom: "inception_4b/1x1_split1"
  top: "inception_4b/1x1_split1"
}
layer {
  name: "inception_4b/3x3_reduce_split1"
  type: "Convolution"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/3x3_reduce_split1"
  param {
    name: "inception4b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_reduce_split1"
  type: "ReLU"
  bottom: "inception_4b/3x3_reduce_split1"
  top: "inception_4b/3x3_reduce_split1"
}
layer {
  name: "inception_4b/3x3_split1"
  type: "Convolution"
  bottom: "inception_4b/3x3_reduce_split1"
  top: "inception_4b/3x3_split1"
  param {
    name: "inception4b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_split1"
  type: "ReLU"
  bottom: "inception_4b/3x3_split1"
  top: "inception_4b/3x3_split1"
}
layer {
  name: "inception_4b/5x5_reduce_split1"
  type: "Convolution"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/5x5_reduce_split1"
  param {
    name: "inception4b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_reduce_split1"
  type: "ReLU"
  bottom: "inception_4b/5x5_reduce_split1"
  top: "inception_4b/5x5_reduce_split1"
}
layer {
  name: "inception_4b/5x5_split1"
  type: "Convolution"
  bottom: "inception_4b/5x5_reduce_split1"
  top: "inception_4b/5x5_split1"
  param {
    name: "inception4b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {    
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_split1"
  type: "ReLU"
  bottom: "inception_4b/5x5_split1"
  top: "inception_4b/5x5_split1"
}
layer {
  name: "inception_4b/pool_split1"
  type: "Pooling"
  bottom: "inception_4a/output_split1"
  top: "inception_4b/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4b/pool_proj_split1"
  type: "Convolution"
  bottom: "inception_4b/pool_split1"
  top: "inception_4b/pool_proj_split1"
  param {
    name: "inception4b/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_pool_proj_split1"
  type: "ReLU"
  bottom: "inception_4b/pool_proj_split1"
  top: "inception_4b/pool_proj_split1"
}
layer {
  name: "inception_4b/output_split1"
  type: "Concat"
  bottom: "inception_4b/1x1_split1"
  bottom: "inception_4b/3x3_split1"
  bottom: "inception_4b/5x5_split1"
  bottom: "inception_4b/pool_proj_split1"
  top: "inception_4b/output_split1"
}
layer {
  name: "inception_4b/drop_split1"
  type: "Dropout"
  bottom: "inception_4b/output_split1"
  top: "inception_4b/output_split1"
  dropout_param {
    dropout_ratio: 0.35
  }
}
layer {
  name: "pool4/2x2_s2_split1"
  type: "Pooling"
  bottom: "inception_4b/output_split1"
  top: "pool4/2x2_s2_split1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4/drop_split1"
  type: "Dropout"
  bottom: "pool4/2x2_s2_split1"
  top: "pool4/2x2_s2_split1"
  dropout_param {
    dropout_ratio: 0.35
  }
}

layer {
  name: "loss_aux2/5x5_s2_split1"
  type: "Convolution"
  bottom: "pool4/2x2_s2_split1"
  top: "loss_aux2/5x5_s2_split1"
  param {
    name: "loss_aux2/5x5_s2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss_aux2/5x5_s2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss_aux2/5x5_s2_relu_split1"
  type: "ReLU"
  bottom: "loss_aux2/5x5_s2_split1"
  top: "loss_aux2/5x5_s2_split1"
}
layer {
  name: "loss_aux2/pool_split1"
  type: "Pooling"
  bottom: "loss_aux2/5x5_s2_split1"
  top: "loss_aux2/pool_split1"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "loss_aux2/drop_split1"
  type: "Dropout"
  bottom: "loss_aux2/pool_split1"
  top: "loss_aux2/dropout_split1"
  dropout_param {
    dropout_ratio: 0.3
  }
}
layer {
  name: "loss_aux2/classifier_split1"
  type: "InnerProduct"
  bottom: "loss_aux2/dropout_split1"
  top: "loss_aux2/classifier_split1"
  param {
    name: "loss2/classifier_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss2/classifier_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_aux2/loss_split1"
  type: "SoftmaxWithLoss"
  bottom: "loss_aux2/classifier_split1"
  bottom: "label2"
  top: "loss_aux2/loss_split1"
  loss_weight: 0.3
}
layer {
  name: "loss_aux2/top-01_split1"
  type: "Accuracy"
  bottom: "loss_aux2/classifier_split1"
  bottom: "label2"
  top: "loss_aux2/top-1_split1"
  #include {
  #  phase: TEST
  #}
}
layer {
  name: "loss_aux2/top-5_split1"
  type: "Accuracy"
  bottom: "loss_aux2/classifier_split1"
  bottom: "label2"
  top: "loss_aux2/top-5_split1"
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "inception_5a/1x1_split1"
  type: "Convolution"
  bottom: "pool4/2x2_s2_split1"
  top: "inception_5a/1x1_split1"
  param {
    name: "inception5a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 196
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_1x1_split1"
  type: "ReLU"
  bottom: "inception_5a/1x1_split1"
  top: "inception_5a/1x1_split1"
}
layer {
  name: "inception_5a/3x3_reduce_split1"
  type: "Convolution"
  bottom: "pool4/2x2_s2_split1"
  top: "inception_5a/3x3_reduce_split1"
  param {
    name: "inception5a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3_reduce_split1"
  type: "ReLU"
  bottom: "inception_5a/3x3_reduce_split1"
  top: "inception_5a/3x3_reduce_split1"
}
layer {
  name: "inception_5a/3x3_split1"
  type: "Convolution"
  bottom: "inception_5a/3x3_reduce_split1"
  top: "inception_5a/3x3_split1"
  param {
    name: "inception5a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3_split1"
  type: "ReLU"
  bottom: "inception_5a/3x3_split1"
  top: "inception_5a/3x3_split1"
}
layer {
  name: "inception_5a/5x5_reduce_split1"
  type: "Convolution"
  bottom: "pool4/2x2_s2_split1"
  top: "inception_5a/5x5_reduce_split1"
  param {
    name: "inception5a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5_reduce_split1"
  type: "ReLU"
  bottom: "inception_5a/5x5_reduce_split1"
  top: "inception_5a/5x5_reduce_split1"
}
layer {
  name: "inception_5a/5x5_split1"
  type: "Convolution"
  bottom: "inception_5a/5x5_reduce_split1"
  top: "inception_5a/5x5_split1"
  param {
    name: "inception5a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5_split1"
  type: "ReLU"
  bottom: "inception_5a/5x5_split1"
  top: "inception_5a/5x5_split1"
}
layer {
  name: "inception_5a/pool_split1"
  type: "Pooling"
  bottom: "pool4/2x2_s2_split1"
  top: "inception_5a/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5a/pool_proj_split1"
  type: "Convolution"
  bottom: "inception_5a/pool_split1"
  top: "inception_5a/pool_proj_split1"
  param {
    name: "inception5a/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_pool_proj_split1"
  type: "ReLU"
  bottom: "inception_5a/pool_proj_split1"
  top: "inception_5a/pool_proj_split1"
}
layer {
  name: "inception_5a/output_split1"
  type: "Concat"
  bottom: "inception_5a/1x1_split1"
  bottom: "inception_5a/3x3_split1"
  bottom: "inception_5a/5x5_split1"
  bottom: "inception_5a/pool_proj_split1"
  top: "inception_5a/output_split1"
}
layer {
  name: "inception_5a/drop_split1"
  type: "Dropout"
  bottom: "inception_5a/output_split1"
  top: "inception_5a/output_split1"
  dropout_param {
    dropout_ratio: 0.35
  }
}
layer {
  name: "inception_5b/1x1_split1"
  type: "Convolution"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/1x1_split1"
  param {
    name: "inception5b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_1x1_split1"
  type: "ReLU"
  bottom: "inception_5b/1x1_split1"
  top: "inception_5b/1x1_split1"
}
layer {
  name: "inception_5b/3x3_reduce_split1"
  type: "Convolution"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/3x3_reduce_split1"
  param {
    name: "inception5b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3_reduce_split1"
  type: "ReLU"
  bottom: "inception_5b/3x3_reduce_split1"
  top: "inception_5b/3x3_reduce_split1"
}
layer {
  name: "inception_5b/3x3_split1"
  type: "Convolution"
  bottom: "inception_5b/3x3_reduce_split1"
  top: "inception_5b/3x3_split1"
  param {
    name: "inception5b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3_split1"
  type: "ReLU"
  bottom: "inception_5b/3x3_split1"
  top: "inception_5b/3x3_split1"
}
layer {
  name: "inception_5b/5x5_reduce_split1"
  type: "Convolution"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/5x5_reduce_split1"
  param {
    name: "inception5b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5_reduce_split1"
  type: "ReLU"
  bottom: "inception_5b/5x5_reduce_split1"
  top: "inception_5b/5x5_reduce_split1"
}
layer {
  name: "inception_5b/5x5_split1"
  type: "Convolution"
  bottom: "inception_5b/5x5_reduce_split1"
  top: "inception_5b/5x5_split1"
  param {
    name: "inception5b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5_split1"
  type: "ReLU"
  bottom: "inception_5b/5x5_split1"
  top: "inception_5b/5x5_split1"
}
layer {
  name: "inception_5b/pool_split1"
  type: "Pooling"
  bottom: "inception_5a/output_split1"
  top: "inception_5b/pool_split1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5b/pool_proj_split1"
  type: "Convolution"
  bottom: "inception_5b/pool_split1"
  top: "inception_5b/pool_proj_split1"
  param {
    name: "inception5b/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5b/proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_pool_proj_split1"
  type: "ReLU"
  bottom: "inception_5b/pool_proj_split1"
  top: "inception_5b/pool_proj_split1"
}
layer {
  name: "inception_5b/output_split1"
  type: "Concat"
  bottom: "inception_5b/1x1_split1"
  bottom: "inception_5b/3x3_split1"
  bottom: "inception_5b/5x5_split1"
  bottom: "inception_5b/pool_proj_split1"
  top: "inception_5b/output_split1"
}
layer {
  name: "pool5/2x2_s2_split1"
  type: "Pooling"
  bottom: "inception_5b/output_split1"
  top: "pool5/2x2_s2_split1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool5/drop_split1"
  type: "Dropout"
  bottom: "pool5/2x2_s2_split1"
  top: "pool5/2x2_s2_split1"
  dropout_param {
    dropout_ratio: 0.35
  }
}
layer {
  name: "conv6/1x1_split1"
  type: "Convolution"
  bottom: "pool5/2x2_s2_split1"
  top: "conv6/1x1_split1"
  param {
    name: "conv6/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv6/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv6/1x1_relu_split1"
  type: "ReLU"
  bottom: "conv6/1x1_split1"
  top: "conv6/1x1_split1"
}
layer {
  name: "pool6/7x7_s1_split1"
  type: "Pooling"
  bottom: "conv6/1x1_split1"
  top: "pool6/7x7_s1_split1"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}



layer {
  name: "loss3/classifier_split1"
  type: "InnerProduct"
  bottom: "pool6/7x7_s1_split1"
  top: "loss3/classifier_split1"
  param {
    name: "loss3/classifier_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss3/classifier_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss3/loss3_split1"
  type: "SoftmaxWithLoss"
  bottom: "loss3/classifier_split1"
  bottom: "label1"
  top: "loss3/loss3_split1"
  loss_weight: 1
}
layer {
  name: "loss3/top-01_split1"
  type: "Accuracy"
  bottom: "loss3/classifier_split1"
  bottom: "label1"
  top: "loss3/top-1_split1"
  #include {
  #  phase: TEST
  #}
}
layer {
  name: "loss3/top-5_split1"
  type: "Accuracy"
  bottom: "loss3/classifier_split1"
  bottom: "label1"
  top: "loss3/top-5_split1"
  #include {
  #  phase: TEST
  #}
  accuracy_param {
    top_k: 5
  }
}


layer {
  name: "conv1_split2"
  type: "Convolution"
  bottom: "data2"
  top: "conv1_split2"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1/relu_split2"
  type: "ReLU"
  bottom: "conv1_split2"
  top: "conv1_split2"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "conv2_split2"
  type: "Convolution"
  bottom: "conv1_split2"
  top: "conv2_split2"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_split2"
  type: "ReLU"
  bottom: "conv2_split2"
  top: "conv2_split2"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  name: "inception_3a/1x1_split2"
  type: "Convolution"
  bottom: "conv2_split2"
  top: "inception_3a/1x1_split2"
  param {
    name: "inception3a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1_split2"
  type: "ReLU"
  bottom: "inception_3a/1x1_split2"
  top: "inception_3a/1x1_split2"
}
layer {
  name: "inception_3a/3x3_reduce_split2"
  type: "Convolution"
  bottom: "conv2_split2"
  top: "inception_3a/3x3_reduce_split2"
  param {
    name: "inception3a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce_split2"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce_split2"
  top: "inception_3a/3x3_reduce_split2"
}
layer {
  name: "inception_3a/3x3_split2"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_split2"
  top: "inception_3a/3x3_split2"
  param {
    name: "inception3a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_split2"
  type: "ReLU"
  bottom: "inception_3a/3x3_split2"
  top: "inception_3a/3x3_split2"
}
layer {
  name: "inception_3a/5x5_reduce_split2"
  type: "Convolution"
  bottom: "conv2_split2"
  top: "inception_3a/5x5_reduce_split2"
  param {
    name: "inception3a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce_split2"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce_split2"
  top: "inception_3a/5x5_reduce_split2"
}
layer {
  name: "inception_3a/5x5_split2"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce_split2"
  top: "inception_3a/5x5_split2"
  param {
    name: "inception3a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_split2"
  type: "ReLU"
  bottom: "inception_3a/5x5_split2"
  top: "inception_3a/5x5_split2"
}
layer {
  name: "inception_3a/pool_split2"
  type: "Pooling"
  bottom: "conv2_split2"
  top: "inception_3a/pool_split2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj_split2"
  type: "Convolution"
  bottom: "inception_3a/pool_split2"
  top: "inception_3a/pool_proj_split2"
  param {
    name: "inception3a/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception3a/proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_pool_proj_split2"
  type: "ReLU"
  bottom: "inception_3a/pool_proj_split2"
  top: "inception_3a/pool_proj_split2"
}
layer {
  name: "inception_3a/output_split2"
  type: "Concat"
  bottom: "inception_3a/1x1_split2"
  bottom: "inception_3a/3x3_split2"
  bottom: "inception_3a/5x5_split2"
  bottom: "inception_3a/pool_proj_split2"
  top: "inception_3a/output_split2"
}
layer {
  name: "pool3/2x2_s2_split2"
  type: "Pooling"
  bottom: "inception_3a/output_split2"
  top: "pool3/2x2_s2_split2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "loss_aux1/5x5_s4_split2"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split2"
  top: "loss_aux1/5x5_s4_split2"
  param {
    name: "loss_aux1/5x5_s4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss_aux1/5x5_s4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    stride: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss_aux1/5x5_s4_relu_split2"
  type: "ReLU"
  bottom: "loss_aux1/5x5_s4_split2"
  top: "loss_aux1/5x5_s4_split2"
}
layer {
  name: "loss_aux1/pool_split2"
  type: "Pooling"
  bottom: "loss_aux1/5x5_s4_split2"
  top: "loss_aux1/pool_split2"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "loss_aux1/drop_split2"
  type: "Dropout"
  bottom: "loss_aux1/pool_split2"
  top: "loss_aux1/dropout_split2"
  dropout_param {
    dropout_ratio: 0.3
  }
}
layer {
  name: "loss_aux1/classifier_split2"
  type: "InnerProduct"
  bottom: "loss_aux1/dropout_split2"
  top: "loss_aux1/classifier_split2"
  param {
    name: "loss1/classifier_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss1/classifier_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_aux1/loss_split2"
  type: "SoftmaxWithLoss"
  bottom: "loss_aux1/classifier_split2"
  bottom: "label2"
  top: "loss_aux1/loss_split2"
  loss_weight: 0.3
}
layer {
  name: "loss_aux1/top-01_split2"
  type: "Accuracy"
  bottom: "loss_aux1/classifier_split2"
  bottom: "label2"
  top: "loss_aux1/top-1_split2"
  #include {
  #  phase: TEST
  #}
}
layer {
  name: "loss_aux1/top-5_split2"
  type: "Accuracy"
  bottom: "loss_aux1/classifier_split2"
  bottom: "label2"
  top: "loss_aux1/top-5_split2"
  #include {
  #  phase: TEST
  #}
  accuracy_param {
    top_k: 5
  }
}

layer {
  name: "inception_4a/1x1_split2"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split2"
  top: "inception_4a/1x1_split2"
  param {
    name: "inception4a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_1x1_split2"
  type: "ReLU"
  bottom: "inception_4a/1x1_split2"
  top: "inception_4a/1x1_split2"
}
layer {
  name: "inception_4a/3x3_reduce_split2"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split2"
  top: "inception_4a/3x3_reduce_split2"
  param {
    name: "inception4a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_reduce_split2"
  type: "ReLU"
  bottom: "inception_4a/3x3_reduce_split2"
  top: "inception_4a/3x3_reduce_split2"
}
layer {
  name: "inception_4a/3x3_split2"
  type: "Convolution"
  bottom: "inception_4a/3x3_reduce_split2"
  top: "inception_4a/3x3_split2"
  param {
    name: "inception4a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_split2"
  type: "ReLU"
  bottom: "inception_4a/3x3_split2"
  top: "inception_4a/3x3_split2"
}
layer {
  name: "inception_4a/5x5_reduce_split2"
  type: "Convolution"
  bottom: "pool3/2x2_s2_split2"
  top: "inception_4a/5x5_reduce_split2"
  param {
    name: "inception4a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_reduce_split2"
  type: "ReLU"
  bottom: "inception_4a/5x5_reduce_split2"
  top: "inception_4a/5x5_reduce_split2"
}
layer {
  name: "inception_4a/5x5_split2"
  type: "Convolution"
  bottom: "inception_4a/5x5_reduce_split2"
  top: "inception_4a/5x5_split2"
  param {
    name: "inception4a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_split2"
  type: "ReLU"
  bottom: "inception_4a/5x5_split2"
  top: "inception_4a/5x5_split2"
}
layer {
  name: "inception_4a/pool_split2"
  type: "Pooling"
  bottom: "pool3/2x2_s2_split2"
  top: "inception_4a/pool_split2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a/pool_proj_split2"
  type: "Convolution"
  bottom: "inception_4a/pool_split2"
  top: "inception_4a/pool_proj_split2"
  param {
    name: "inception4a/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4a/ptoj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_pool_proj_split2"
  type: "ReLU"
  bottom: "inception_4a/pool_proj_split2"
  top: "inception_4a/pool_proj_split2"
}
layer {
  name: "inception_4a/output_split2"
  type: "Concat"
  bottom: "inception_4a/1x1_split2"
  bottom: "inception_4a/3x3_split2"
  bottom: "inception_4a/5x5_split2"
  bottom: "inception_4a/pool_proj_split2"
  top: "inception_4a/output_split2"
}
layer {
  name: "inception_4a/drop_split2"
  type: "Dropout"
  bottom: "inception_4a/output_split2"
  top: "inception_4a/output_split2"
  dropout_param {
    dropout_ratio: 0.35
  }
}
layer {
  name: "inception_4b/1x1_split2"
  type: "Convolution"
  bottom: "inception_4a/output_split2"
  top: "inception_4b/1x1_split2"
  param {
    name: "inception4b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_1x1_split2"
  type: "ReLU"
  bottom: "inception_4b/1x1_split2"
  top: "inception_4b/1x1_split2"
}
layer {
  name: "inception_4b/3x3_reduce_split2"
  type: "Convolution"
  bottom: "inception_4a/output_split2"
  top: "inception_4b/3x3_reduce_split2"
  param {
    name: "inception4b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_reduce_split2"
  type: "ReLU"
  bottom: "inception_4b/3x3_reduce_split2"
  top: "inception_4b/3x3_reduce_split2"
}
layer {
  name: "inception_4b/3x3_split2"
  type: "Convolution"
  bottom: "inception_4b/3x3_reduce_split2"
  top: "inception_4b/3x3_split2"
  param {
    name: "inception4b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_split2"
  type: "ReLU"
  bottom: "inception_4b/3x3_split2"
  top: "inception_4b/3x3_split2"
}
layer {
  name: "inception_4b/5x5_reduce_split2"
  type: "Convolution"
  bottom: "inception_4a/output_split2"
  top: "inception_4b/5x5_reduce_split2"
  param {
    name: "inception4b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_reduce_split2"
  type: "ReLU"
  bottom: "inception_4b/5x5_reduce_split2"
  top: "inception_4b/5x5_reduce_split2"
}
layer {
  name: "inception_4b/5x5_split2"
  type: "Convolution"
  bottom: "inception_4b/5x5_reduce_split2"
  top: "inception_4b/5x5_split2"
  param {
    name: "inception4b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_split2"
  type: "ReLU"
  bottom: "inception_4b/5x5_split2"
  top: "inception_4b/5x5_split2"
}
layer {
  name: "inception_4b/pool_split2"
  type: "Pooling"
  bottom: "inception_4a/output_split2"
  top: "inception_4b/pool_split2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4b/pool_proj_split2"
  type: "Convolution"
  bottom: "inception_4b/pool_split2"
  top: "inception_4b/pool_proj_split2"
  param {
    name: "inception4b/proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception4b/proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_pool_proj_split2"
  type: "ReLU"
  bottom: "inception_4b/pool_proj_split2"
  top: "inception_4b/pool_proj_split2"
}
layer {
  name: "inception_4b/output_split2"
  type: "Concat"
  bottom: "inception_4b/1x1_split2"
  bottom: "inception_4b/3x3_split2"
  bottom: "inception_4b/5x5_split2"
  bottom: "inception_4b/pool_proj_split2"
  top: "inception_4b/output_split2"
}
layer {
  name: "inception_4b/drop_split2"
  type: "Dropout"
  bottom: "inception_4b/output_split2"
  top: "inception_4b/output_split2"
  dropout_param {
    dropout_ratio: 0.35
  }
}
layer {
  name: "pool4/2x2_s2_split2"
  type: "Pooling"
  bottom: "inception_4b/output_split2"
  top: "pool4/2x2_s2_split2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4/drop_split2"
  type: "Dropout"
  bottom: "pool4/2x2_s2_split2"
  top: "pool4/2x2_s2_split2"
  dropout_param {
    dropout_ratio: 0.35
  }
}
layer {
  name: "loss_aux2/5x5_s2_split2"
  type: "Convolution"
  bottom: "pool4/2x2_s2_split2"
  top: "loss_aux2/5x5_s2_split2"
  param {
    name: "loss_aux2/5x5_s2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss_aux2/5x5_s2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss_aux2/5x5_s2_relu_split2"
  type: "ReLU"
  bottom: "loss_aux2/5x5_s2_split2"
  top: "loss_aux2/5x5_s2_split2"
}
layer {
  name: "loss_aux2/pool_split2"
  type: "Pooling"
  bottom: "loss_aux2/5x5_s2_split2"
  top: "loss_aux2/pool_split2"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "loss_aux2/drop_split2"
  type: "Dropout"
  bottom: "loss_aux2/pool_split2"
  top: "loss_aux2/dropout_split2"
  dropout_param {
    dropout_ratio: 0.3
  }
}
layer {
  name: "loss_aux2/classifier_split2"
  type: "InnerProduct"
  bottom: "loss_aux2/dropout_split2"
  top: "loss_aux2/classifier_split2"
  param {
    name: "loss2/classifier_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss2/classifier_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3407
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_aux2/loss_split2"
  type: "SoftmaxWithLoss"
  bottom: "loss_aux2/classifier_split2"
  bottom: "label2"
  top: "loss_aux2/loss_split2"
  loss_weight: 0.3
}
layer {
  name: "loss_aux2/top-01_split2"
  type: "Accuracy"
  bottom: "loss_aux2/classifier_split2"
  bottom: "label2"
  top: "loss_aux2/top-1_split2"
  #include {
  #  phase: TEST
  #}
}
layer {
  name: "loss_aux2/top-5_split2"
  type: "Accuracy"
  bottom: "loss_aux2/classifier_split2"
  bottom: "label2"
  top: "loss_aux2/top-5_split2"
  accuracy_param {
    top_k: 5
  }
}

layer {
  name: "inception_5a/1x1_split2"
  type: "Convolution"
  bottom: "pool4/2x2_s2_split2"
  top: "inception_5a/1x1_split2"
  param {
    name: "inception5a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 196
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_1x1_split2"
  type: "ReLU"
  bottom: "inception_5a/1x1_split2"
  top: "inception_5a/1x1_split2"
}
layer {
  name: "inception_5a/3x3_reduce_split2"
  type: "Convolution"
  bottom: "pool4/2x2_s2_split2"
  top: "inception_5a/3x3_reduce_split2"
  param {
    name: "inception5a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception5a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
